CodeIgniter_Team_Manager/app/Models/LeagueModel.php

    public function getOneLeague(?int $id = null): object|false
    {
        if (empty($id)) {
            return false;
        }

        return $this->find($id) ?: false;
---
SELECT *
FROM `leagues`
WHERE `leagues`.`id` = 1

    public function getLeagues(): array|false
    {
        $rows = $this->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `leagues`
ORDER BY `name` ASC