CodeIgniter_Team_Manager/app/Models/PlayerModel.php

SELECT *
FROM `players`
WHERE `players`.`id` = 1
---
    public function getOnePlayer(?int $id = null): object|false
    {
        if (empty($id)) {
            return false;
        }

        return $this->find($id) ?: false;

SELECT *
FROM `players`
ORDER BY `team_id` ASC
---
    public function getPlayers(): array|false
    {
        $rows = $this->orderBy('team_id', 'ASC')->findAll();