CodeIgniter_Team_Manager/app/Models/TeamModel.php

SELECT *
FROM `teams`
WHERE `teams`.`id` = 1
---
    public function getOneTeam(?int $id = null): object|false
    {
        if (empty($id)) {
            return false;
        }

        return $this->find($id) ?: false;

SELECT *
FROM `teams`
ORDER BY `league_id` ASC
---
    public function getTeams(): array|false
    {
        $rows = $this->orderBy('league_id', 'ASC')->findAll();