CodeIgniter_Team_Manager/app/Controllers/Admin/Player.php

    public function save()
    {
        $rules = [
            'first_name' => 'required',
            'last_name' => 'required',
            'team_id' => 'required',
            'email' => 'permit_empty|valid_email',
        ];

        if (! $this->validate($rules)) {
            return $this->render('admin/player/edit', [
                'player' => (object) $this->request->getPost(),
                'states' => get_states(),
                'teams' => $this->team->getTeamOptions(),
                'errors' => $this->validator->getErrors(),
            ]);
        }

        $id = $this->request->getPost('id');
        $data = [
            'first_name' => $this->request->getPost('first_name'),
            'last_name' => $this->request->getPost('last_name'),
            'team_id' => $this->request->getPost('team_id'),
            'address' => $this->request->getPost('address'),
            'city' => $this->request->getPost('city'),
            'state_id' => $this->request->getPost('state_id'),
            'zip' => $this->request->getPost('zip'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone'),
        ];
        $result = $id ? $this->player->update($id, $data) : $this->player->insert($data);
---
UPDATE `players` SET `first_name` = 'Billy', `last_name` = 'Bob', `team_id` = '1', `address` = '', `city` = '', `state_id` = '', `zip` = '', `email` = '', `phone` = ''
WHERE `players`.`id` IN ('1')