CodeIgniter_Team_Manager/app/Helpers/state_helper.php

    function get_states(): array|false
    {
        $rows = Database::connect()
            ->table('states')
            ->select('id, name')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResult();
---
SELECT `id`, `name`
FROM `states`
ORDER BY `name` ASC

    function get_state_abbrs(): array|false
    {
        $rows = Database::connect()
            ->table('states')
            ->select('id, abbr')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResult();
---
SELECT `id`, `abbr`
FROM `states`
ORDER BY `id` ASC